namespace MovieBot.Infractructure
{
    public static class Constants
    {
        public static string DefaultLlmAnswer = "повторите запрос позже";
        
        public static readonly string[] Answers = { 
            "Одна ошибка - и ты ошибся",
            "Проснись, Нео. Ты ошибся.", 
            "404 нот фаунд",
            "Хьюстон, у нас проблема! Данный фильм не найден! Повторяю: данный фильм не найден!",
            "Всегда помни, Фродо, кино пытается вернуться к своему хозяину. Оно хочет быть найденным",
            "Что-то пошло не по плану...",
            "Мимо, господа!",
            "Этот фильм не существует",
            "Прилетело НЛО и похитело этот фильм",
            "Если жизнь - вечный поиск, попробуйте еще раз",
            "Количество запросов без ошибок: &nbsp;&#0822;24&#0822;&nbsp; 0",
            "Не исключаю, что вы неправильно написали запрос",
            @"¯\_(ツ)_/¯" };
    }
}
